const TIMELINE = [
  {
    id: 0,
    title: 'University of Minnesota',
    date: '2014.09 - 2020.05',
    detail:
      '컴퓨터 공학과를 졸업하여 다양한 프로그래밍 경험을 시작할 수 있었던 귀한 경험이었습니다.',
  },
  {
    id: 1,
    title: '서울대병원',
    date: '2021.02 - 2022.08',
    detail:
      '서울대학교 병원 영상의학과에서 소프트웨어 및 웹 개발을 주로 하였으며, CT 이미지를 웹 상에서 보일 수 있게하는 프로젝트를 진행했습니다.',
  },
  {
    id: 2,
    title: '프로그라피 7기',
    date: '2022.03 - 2022.07',
    detail:
      '개발 동아리이며 디자이너, 백엔드, 프론트엔드 개발자들과 협업하여 사이드 프로젝트를 진행했습니다.',
  },
  {
    id: 3,
    title: '아데나 소프트웨어',
    date: '2022.11 - ',
    detail:
      '개발 동아리이며 디자이너, 백엔드, 프론트엔드 개발자들과 협업하여 사이드 프로젝트를 진행했습니다.',
  },
]

export default TIMELINE
